JamesBara/CMSIS_DAP_STM32L412_Port/inc/DAP_config.h
    GPIO_MODER_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_OTYPER_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_OSPEEDR_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_PUPDR_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_MODER_OUTPUT(GPIO_nTRST, PIN_nTRST);
    GPIO_OSPEEDR_VERY_HIGH_SPEED(GPIO_nTRST, PIN_nTRST);
    GPIO_SET_ODR(GPIO_nTRST, PIN_nTRST, 1);

    GPIO_MODER_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_OTYPER_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_OSPEEDR_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_PUPDR_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_MODER_OUTPUT(GPIO_nRESET, PIN_nRESET);
    GPIO_OSPEEDR_VERY_HIGH_SPEED(GPIO_nRESET, PIN_nRESET);
    GPIO_SET_ODR(GPIO_nRESET, PIN_nRESET, 1);

    GPIO_MODER_INPUT(GPIO_TDO, PIN_TDO);
}

/** Setup SWD I/O pins: SWCLK, SWDIO, and nRESET.
Configures the DAP Hardware I/O pins for Serial Wire Debug (SWD) mode:
 - SWCLK, SWDIO, nRESET to output mode and set to default high level.
 - TDI, nTRST to HighZ mode (pins are unused in SWD mode).
*/
__STATIC_INLINE void PORT_SWD_SETUP (void) {
    GPIO_MODER_CLEAR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
    GPIO_OSPEEDR_CLEAR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
    GPIO_MODER_OUTPUT(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
    GPIO_OSPEEDR_VERY_HIGH_SPEED(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
    GPIO_SET_ODR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK, 1);

    GPIO_MODER_CLEAR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
    GPIO_OSPEEDR_CLEAR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
    GPIO_MODER_OUTPUT(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
    GPIO_OSPEEDR_VERY_HIGH_SPEED(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
    GPIO_SET_ODR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS, 1);

    GPIO_MODER_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_OTYPER_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_OSPEEDR_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_PUPDR_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_PUPDR_PU(GPIO_nRESET, PIN_nRESET);
    GPIO_MODER_OUTPUT(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
    GPIO_OSPEEDR_VERY_HIGH_SPEED(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
    GPIO_SET_ODR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK, 1);

    GPIO_MODER_CLEAR(GPIO_TDI, PIN_TDI);
    GPIO_OSPEEDR_CLEAR(GPIO_TDI, PIN_TDI);
    GPIO_MODER_ANALOG(GPIO_TDI, PIN_TDI);

    GPIO_MODER_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_OTYPER_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_OSPEEDR_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_PUPDR_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_MODER_ANALOG(GPIO_nTRST, PIN_nTRST);
}

/** Disable JTAG/SWD I/O Pins.
Disables the DAP Hardware I/O pins which configures:
 - TCK/SWCLK, TMS/SWDIO, TDI, TDO, nTRST, nRESET to High-Z mode.
*/
__STATIC_INLINE void PORT_OFF (void) {
    GPIO_MODER_CLEAR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
    GPIO_OSPEEDR_CLEAR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
    GPIO_MODER_ANALOG(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);

    GPIO_MODER_CLEAR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
    GPIO_OSPEEDR_CLEAR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
    GPIO_MODER_ANALOG(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);

    GPIO_MODER_CLEAR(GPIO_TDI, PIN_TDI);
    GPIO_OSPEEDR_CLEAR(GPIO_TDI, PIN_TDI);
    GPIO_MODER_ANALOG(GPIO_TDI, PIN_TDI);

    GPIO_MODER_ANALOG(GPIO_TDO, PIN_TDO);

    GPIO_MODER_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_OTYPER_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_OSPEEDR_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_PUPDR_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_MODER_ANALOG(GPIO_nRESET, PIN_nRESET);

    GPIO_MODER_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_OTYPER_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_OSPEEDR_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_PUPDR_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_MODER_ANALOG(GPIO_nTRST, PIN_nTRST);
}


// SWCLK/TCK I/O pin -------------------------------------

/** SWCLK/TCK I/O pin: Get Input.
\return Current status of the SWCLK/TCK DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWCLK_TCK_IN  (void) {
    return GPIO_GET_IDR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
}

/** SWCLK/TCK I/O pin: Set Output to High.
Set the SWCLK/TCK DAP hardware I/O pin to high level.
*/
__STATIC_FORCEINLINE void     PIN_SWCLK_TCK_SET (void) {
    GPIO_SET_ODR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK, 1);
}

/** SWCLK/TCK I/O pin: Set Output to Low.
Set the SWCLK/TCK DAP hardware I/O pin to low level.
*/
__STATIC_FORCEINLINE void     PIN_SWCLK_TCK_CLR (void) {
    GPIO_SET_ODR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK, 0);
}

// SWDIO/TMS Pin I/O --------------------------------------

/** SWDIO/TMS I/O pin: Get Input.
\return Current status of the SWDIO/TMS DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWDIO_TMS_IN  (void) {
    return GPIO_GET_IDR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
}

/** SWDIO/TMS I/O pin: Set Output to High.
Set the SWDIO/TMS DAP hardware I/O pin to high level.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_TMS_SET (void) {
    GPIO_SET_ODR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS, 1);
}

/** SWDIO/TMS I/O pin: Set Output to Low.
Set the SWDIO/TMS DAP hardware I/O pin to low level.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_TMS_CLR (void) {
    GPIO_SET_ODR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS, 0);
}

/** SWDIO I/O pin: Get Input (used in SWD mode only).
\return Current status of the SWDIO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWDIO_IN      (void) {
    return GPIO_GET_IDR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
}

/** SWDIO I/O pin: Set Output (used in SWD mode only).
\param bit Output value for the SWDIO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT     (uint32_t bit) {
    GPIO_SET_ODR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS, bit);
}

/** SWDIO I/O pin: Switch to Output mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to output mode. This function is
called prior \ref PIN_SWDIO_OUT function calls.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT_ENABLE  (void) {
    GPIO_MODER_OUTPUT(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
}

/** SWDIO I/O pin: Switch to Input mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to input mode. This function is
called prior \ref PIN_SWDIO_IN function calls.
*/
__STATIC_FORCEINLINE void     PIN_SWDIO_OUT_DISABLE (void) {
    GPIO_MODER_INPUT(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
}


// TDI Pin I/O ---------------------------------------------

/** TDI I/O pin: Get Input.
\return Current status of the TDI DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_TDI_IN  (void) {
    return GPIO_GET_IDR(GPIO_TDI, PIN_TDI);
}

/** TDI I/O pin: Set Output.
\param bit Output value for the TDI DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE void     PIN_TDI_OUT (uint32_t bit) {
    GPIO_SET_ODR(GPIO_TDI, PIN_TDI, bit);
}


// TDO Pin I/O ---------------------------------------------

/** TDO I/O pin: Get Input.
\return Current status of the TDO DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_TDO_IN  (void) {
    return GPIO_GET_IDR(GPIO_TDO, PIN_TDO);
}


// nTRST Pin I/O -------------------------------------------

