JamesBara/CMSIS_DAP_STM32L412_Port/inc/DAP_config.h
/** nTRST I/O pin: Get Input.
\return Current status of the nTRST DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_nTRST_IN   (void) {
    return GPIO_GET_IDR(GPIO_nTRST, PIN_nTRST);
}

/** nTRST I/O pin: Set Output.
\param bit JTAG TRST Test Reset pin status:
           - 0: issue a JTAG TRST Test Reset.
           - 1: release JTAG TRST Test Reset.
*/
__STATIC_FORCEINLINE void     PIN_nTRST_OUT  (uint32_t bit) {
    GPIO_SET_ODR(GPIO_nTRST, PIN_nTRST, bit);
}

// nRESET Pin I/O------------------------------------------

/** nRESET I/O pin: Get Input.
\return Current status of the nRESET DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_nRESET_IN  (void) {
    return GPIO_GET_IDR(GPIO_nRESET, PIN_nRESET);
}

/** nRESET I/O pin: Set Output.
\param bit target device hardware reset pin status:
           - 0: issue a device hardware reset.
           - 1: release device hardware reset.
*/
__STATIC_FORCEINLINE void     PIN_nRESET_OUT (uint32_t bit) {
    GPIO_SET_ODR(GPIO_nRESET, PIN_nRESET, bit);
}

///@}


//**************************************************************************************************
/**
\defgroup DAP_Config_LEDs_gr CMSIS-DAP Hardware Status LEDs
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware may provide LEDs that indicate the status of the CMSIS-DAP Debug Unit.

It is recommended to provide the following LEDs for status indication:
 - Connect LED: is active when the DAP hardware is connected to a debugger.
 - Running LED: is active when the debugger has put the target device into running state.
*/

/** Debug Unit: Set status of Connected LED.
\param bit status of the Connect LED.
           - 1: Connect LED ON: debugger is connected to CMSIS-DAP Debug Unit.
           - 0: Connect LED OFF: debugger is not connected to CMSIS-DAP Debug Unit.
*/
__STATIC_INLINE void LED_CONNECTED_OUT(uint32_t bit) { GPIO_SET_ODR(GPIO_LED_CONNECTED, PIN_LED_CONNECTED, bit); }

/** Debug Unit: Set status Target Running LED.
\param bit status of the Target Running LED.
           - 1: Target Running LED ON: program execution in target started.
           - 0: Target Running LED OFF: program execution in target stopped.
*/
__STATIC_INLINE void LED_RUNNING_OUT(uint32_t bit) { GPIO_SET_ODR(GPIO_LED_RUNNING, PIN_LED_RUNNING, bit); }

///@}


//**************************************************************************************************
/**
\defgroup DAP_Config_Timestamp_gr CMSIS-DAP Timestamp
\ingroup DAP_ConfigIO_gr
@{
Access function for Test Domain Timer.

The value of the Test Domain Timer in the Debug Unit is returned by the function \ref TIMESTAMP_GET. By
default, the DWT timer is used.  The frequency of this timer is configured with \ref TIMESTAMP_CLOCK.

*/

/** Get timestamp of Test Domain Timer.
\return Current timestamp value.
*/
__STATIC_INLINE uint32_t TIMESTAMP_GET (void) {
  return (DWT->CYCCNT);
}

///@}


//**************************************************************************************************
/**
\defgroup DAP_Config_Initialization_gr CMSIS-DAP Initialization
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware I/O and LED Pins are initialized with the function \ref DAP_SETUP.
*/

/** Setup of the Debug Unit I/O pins and LEDs (called when Debug Unit is initialized).
This function performs the initialization of the CMSIS-DAP Hardware I/O Pins and the
Status LEDs. In detail the operation of Hardware I/O and LED pins are enabled and set:
 - I/O clock system enabled.
 - all I/O pins: input buffer enabled, output pins are set to HighZ mode.
 - for nTRST, nRESET a weak pull-up (if available) is enabled.
 - LED output pins are enabled and LEDs are turned off.
*/
__STATIC_INLINE void DAP_SETUP (void) {
    SET(RCC->AHB2ENR, RCC_SWCLK_TCK);
    __spinlock(2);
    SET(RCC->AHB2ENR, RCC_SWDIO_TMS);
    __spinlock(2);
    SET(RCC->AHB2ENR, RCC_TDI);
    __spinlock(2);
    SET(RCC->AHB2ENR, RCC_TDO);
    __spinlock(2);
    SET(RCC->AHB2ENR, RCC_nRESET);
    __spinlock(2);
    SET(RCC->AHB2ENR, RCC_nTRST);
    __spinlock(2);
    SET(RCC->AHB2ENR, RCC_LED_CONNECTED);
    __spinlock(2);
    SET(RCC->AHB2ENR, RCC_LED_RUNNING);
    __spinlock(2);

    GPIO_MODER_CLEAR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
    GPIO_OTYPER_CLEAR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
    GPIO_OSPEEDR_CLEAR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
    GPIO_PUPDR_CLEAR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);
    GPIO_AFRN_CLEAR(GPIO_SWCLK_TCK, PIN_SWCLK_TCK);

    GPIO_MODER_CLEAR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
    GPIO_OTYPER_CLEAR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
    GPIO_OSPEEDR_CLEAR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
    GPIO_PUPDR_CLEAR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);
    GPIO_AFRN_CLEAR(GPIO_SWDIO_TMS, PIN_SWDIO_TMS);

    GPIO_MODER_CLEAR(GPIO_TDI, PIN_TDI);
    GPIO_OTYPER_CLEAR(GPIO_TDI, PIN_TDI);
    GPIO_OSPEEDR_CLEAR(GPIO_TDI, PIN_TDI);
    GPIO_PUPDR_CLEAR(GPIO_TDI, PIN_TDI);
    GPIO_AFRN_CLEAR(GPIO_TDI, PIN_TDI);

    GPIO_MODER_CLEAR(GPIO_TDO, PIN_TDO);
    GPIO_OTYPER_CLEAR(GPIO_TDO, PIN_TDO);
    GPIO_OSPEEDR_CLEAR(GPIO_TDO, PIN_TDO);
    GPIO_PUPDR_CLEAR(GPIO_TDO, PIN_TDO);
    GPIO_AFRN_CLEAR(GPIO_TDO, PIN_TDO);

    GPIO_MODER_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_OTYPER_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_OSPEEDR_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_PUPDR_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_AFRN_CLEAR(GPIO_nRESET, PIN_nRESET);
    GPIO_PUPDR_PU(GPIO_nRESET, PIN_nRESET);

    GPIO_MODER_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_OTYPER_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_OSPEEDR_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_PUPDR_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_AFRN_CLEAR(GPIO_nTRST, PIN_nTRST);
    GPIO_PUPDR_PU(GPIO_nTRST, PIN_nTRST);

    GPIO_MODER_CLEAR(GPIO_LED_CONNECTED, PIN_LED_CONNECTED);
    GPIO_OTYPER_CLEAR(GPIO_LED_CONNECTED, PIN_LED_CONNECTED);
    GPIO_OSPEEDR_CLEAR(GPIO_LED_CONNECTED, PIN_LED_CONNECTED);
    GPIO_PUPDR_CLEAR(GPIO_LED_CONNECTED, PIN_LED_CONNECTED);
    GPIO_AFRN_CLEAR(GPIO_LED_CONNECTED, PIN_LED_CONNECTED);
    GPIO_MODER_OUTPUT(GPIO_LED_CONNECTED, PIN_LED_CONNECTED);
    GPIO_SET_ODR(GPIO_LED_CONNECTED, PIN_LED_CONNECTED, 0);

    GPIO_MODER_CLEAR(GPIO_LED_RUNNING, PIN_LED_RUNNING);
    GPIO_OTYPER_CLEAR(GPIO_LED_RUNNING, PIN_LED_RUNNING);
    GPIO_OSPEEDR_CLEAR(GPIO_LED_RUNNING, PIN_LED_RUNNING);
    GPIO_PUPDR_CLEAR(GPIO_LED_RUNNING, PIN_LED_RUNNING);
    GPIO_AFRN_CLEAR(GPIO_LED_RUNNING, PIN_LED_RUNNING);
    GPIO_MODER_OUTPUT(GPIO_LED_RUNNING, PIN_LED_RUNNING);
    GPIO_SET_ODR(GPIO_LED_RUNNING, PIN_LED_RUNNING, 0);
}

/** Reset Target Device with custom specific I/O pin or command sequence.
This function allows the optional implementation of a device specific reset sequence.
It is called when the command \ref DAP_ResetTarget and is for example required
when a device needs a time-critical unlock sequence that enables the debug port.
\return 0 = no device specific reset sequence is implemented.\n
        1 = a device specific reset sequence is implemented.
*/
__STATIC_INLINE uint8_t RESET_TARGET (void) {
  return (0U);             // change to '1' when a device reset sequence is implemented
}

///@}


#endif /* __DAP_CONFIG_H__ */
